# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

In [2]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

In [4]:
baby_names = pd.read_csv(path+"/DATA/US_Baby_Names_right.csv")

### Step 3. Assign it to a variable called baby_names.

In [5]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [6]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [21]:
baby_names = baby_names.drop(columns=['Unnamed: 0', 'Id'])

### Step 6. Are there more male or female names in the dataset?

In [22]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [95]:
names = baby_names.groupby(baby_names['Name'])

### Step 8. How many different names exist in the dataset?

In [96]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [102]:
names.size().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [123]:
names.get_group('Aadarsh')

           Name  Year Gender State  Count
323950  Aadarsh  2009      M    IL      5

In [124]:
names.size().where(sizes==1).count()

3682

### Step 11. What is the median name occurrence?

In [139]:
names.size().median()

8.0

### Step 12. What is the standard deviation of names?

In [126]:
names.size().std()

122.02996350814125

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [145]:
def rename(newname):
    def decorator(f):
        f.__name__ = newname
        return f
    return decorator

def q_at(y):
    @rename(f'q{y:0.2f}')
    def q(x):
        return x.quantile(y)
    return q

names.size().agg(['mean','min', 'max','std','median',q_at(0.25),q_at(0.75)])

mean        57.644907
min          1.000000
max       1112.000000
std        122.029964
median       8.000000
q0.25        2.000000
q0.75       39.000000
dtype: float64